# ДЗ 5. Шахматный конь - НЕ готово

a = int(input('введите координты по горизонтали 1й клетки: '))
a1 = int(input('введите координты по вертикали 1й клетки: '))

b = int(input('введите координты по горизонтали 2й клетки: '))
b1 = int(input('введите координты по вертикали 2й клетки: '))

print(a, a1, b, b1)

#Шахматный конь ходит буквой “Г” — на две клетки по вертикали в любом направлении и на одну клетку по горизонтали, или наоборот.
#Даны две различные клетки шахматной доски, определите, может ли конь попасть с первой клетки на вторую одним ходом.

#a+=2

#if a != b:
 #   a+=2

if a != b


#horse = a+2 or a-2 and a1+1 or a1-1

#print(horse)

#12 + 2 и 21 + 1 или 21+2 и 12+1

#12-2 и 21 + 1  или


#12+2 или 12-2 и 21+1 или 21-1

#21+2 или 21-2 и 12+2 или 12-2

